# IdeaStatiCa.ConnectionApi.Model.BeamData

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Name** | **string** |  | [optional]
**Plates** | **List&lt;PlateData&gt;** |  | [optional]
**CrossSectionType** | **string** |  | [optional]
**MprlName** | **string** |  | [optional]
**OriginalModelId** | **string** |  | [optional]
**Cuts** | **List&lt;CutData&gt;** |  | [optional]
**IsAdded** | **bool** |  | [optional]
**AddedMemberLength** | **double** |  | [optional]
**IsNegativeObject** | **bool** |  | [optional]
**AddedMember** | **ReferenceElement** |  | [optional]
**MirrorY** | **bool** |  | [optional]
**RefLineInCenterOfGravity** | **bool** |  | [optional]
**IsBearingMember** | **bool** |  | [optional]
**AutoAddCutByWorkplane** | **bool** |  | [optional]
**Id** | **int** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)